# Studio: Working with Databases in Python

For today's studio, we will be using the [TV Shows dataset](https://www.kaggle.com/ruchi798/tv-shows-on-netflix-prime-video-hulu-and-disney) from Kaggle. We have already downloaded the CSV for you.

You will also be using the watchlist you just created to figure out which streaming services contain the shows that you want to watch next so you can decide which one is worth the money to you.

As you complete the different tasks in the studio, you may choose between using Pandas or SQL. Remember that during the prep work, we learned that one is oftentimes more efficient at certain tasks than the other, so choose wisely!

## My Watchlist

If you would like, please use this space to make note of your watchlist by editing the text cell.

## Database Setup

To start with, import the necessary libraries and create a dataframe from the provided CSV. Print the info out for the dataframe. After that, you may drop the column called `Unnamed: 0` and rename any columns with spaces in the names or unusual characters such as `"+"`. Print out the info for the dataframe again to ensure that your changes were effective.

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import sqlite3
df = pd.read_csv("tv_shows.csv")
df.head()
df=df.drop("Unnamed: 0", axis=1)
df=df.rename(columns={'Disney+': 'Disney', 'Prime Video': 'Prime', 'Rotten Tomatoes': 'RT'})
df.head()

,ID,Title,Year,Age,IMDb,RT,Netflix,Hulu,Prime,Disney,Type
0,1,Breaking Bad,2008,18+,9.4/10,100/100,1,0,0,0,1
1,2,Stranger Things,2016,16+,8.7/10,96/100,1,0,0,0,1
2,3,Attack on Titan,2013,18+,9.0/10,95/100,1,1,0,0,1
3,4,Better Call Saul,2015,18+,8.8/10,94/100,1,0,0,0,1
4,5,Dark,2017,16+,8.8/10,93/100,1,0,0,0,1

With your dataframe at the ready, create a new database called `tv`. Add a new table to your database called `shows` using the data in the dataframe.

In [4]:
import sqlite3

conn = sqlite3.connect('tv.db')
df.to_sql("shows", conn, if_exists='replace')

#conn.execute('''CREATE TABLE shows
#         (ID INT PRIMARY KEY     NOT NULL,
#         Title TEXT NOT NULL);''')

5368

In [5]:


data= pd.read_sql_query("Select * from shows", conn)
data.head(5)

,index,ID,Title,Year,Age,IMDb,RT,Netflix,Hulu,Prime,Disney,Type
0,0,1,Breaking Bad,2008,18+,9.4/10,100/100,1,0,0,0,1
1,1,2,Stranger Things,2016,16+,8.7/10,96/100,1,0,0,0,1
2,2,3,Attack on Titan,2013,18+,9.0/10,95/100,1,1,0,0,1
3,3,4,Better Call Saul,2015,18+,8.8/10,94/100,1,0,0,0,1
4,4,5,Dark,2017,16+,8.8/10,93/100,1,0,0,0,1

With your new table and database set up, print out the top 20 records in the `shows` table.

Now add a table that includes an id number and the titles on your watchlist.

In [6]:

conn.execute(""" DROP TABLE IF EXISTS watchlist;""")
conn.execute(""" CREATE TABLE watchlist (
    ID INTERGER,
    Title TEXT );""")

conn = sqlite3.connect('tv.db')
print ("Opened database successfully");

conn.execute("INSERT INTO watchlist (ID,Title) \
      VALUES (1, 'Dark' )");

conn.execute("INSERT INTO watchlist (ID,Title) \
      VALUES (2, 'Better Call Saul' )");

conn.execute("INSERT INTO watchlist (ID,Title) \
      VALUES (3, 'Succession' )");

conn.execute("INSERT INTO watchlist (ID,Title) \
      VALUES (4, 'The Office' )");


data2=pd.read_sql_query('Select * from watchlist', conn)
data2.head()

Opened database successfully

   ID             Title
0   1              Dark
1   2  Better Call Saul
2   3        Succession
3   4        The Office

## Working with the Data

Using either Pandas or SQL, determine how many shows are on each streaming service and what the mean is for each streaming service. 

**Note**: You may notice that the mean represents the percentage of shows in the dataframe that are on each streaming service. Take a moment to think about why that is.

In [313]:
data3=pd.read_sql_query("select count(Netflix) as Netflix from shows where Netflix=1", conn)
data3
data4=pd.read_sql_query("select count(Hulu) as Hulu from shows where Hulu=1", conn)
data4
data5=pd.read_sql_query("select count(Disney) as Disney from shows where Disney=1", conn)
data5
data6=pd.read_sql_query("select count(Prime) from shows where Prime=1", conn)
data6

   count(Prime)
0          1831

Join your watchlist data with the shows data to determine which streaming services your watchlist shows are on and make a new table in your database using the joined data. Print out the data in your joined table to see what shows on your watchlist on in the original dataset. With the joined data, determine the percentage of your watchlist shows that are on each streaming service and how many of your watchlist shows are on each streaming service.

In [9]:
data2=pd.read_sql_query("""Select * from watchlist
left join watchlist on watchlist.Title=shows.title""", conn)
data2.head()

DatabaseError: Execution failed on sql 'Select * from watchlist
left join watchlist on watchlist.Title=shows.title': ambiguous column name: main.watchlist.ID

## Results

Now that you have done your analysis, make note of the answers to the following questions by editing the text cell:

1. Was every show on your watchlist in the Kaggle dataset? Do you have any ideas as to why a show might not have been present?
2. Did you include a show or shows in your watchlist that is exclusive to one of the platforms? How might that have impacted your analysis?
2. Which streaming service(s) offered the most shows on your watchlist? Which streaming service(s) offered the least?
3. Based on the shows you want to watch and the results of your analysis, is there a streaming service you think would be a good fit for you?